export interface IRozkladItem {
  object: string; // Назва групи для якої цей розклад був знайдений.
  date: string; // Дата проведення.
  comment: string; // Вроді як вказує чи є коментарій в comment4link, Варіанти: "0", "1", "".
  lesson_number: string; // Індекс для таблички в Деканат++ розкладі.
  lesson_name: string; // Теж саме що і lesson_number.
  lesson_time: string; // Час проведення пари, до прикладу: "08:30-09:50", "13:30-14:50".
  half: string; // Варіанти: "1 півпара", "2 півпара", "".
  teacher: string; // Імя вчителля, але може і не бути.
  teachers_add: string; // Не їбу що це.
  room: string; // Назва аудиторії, але може і не бути.
  group: string; // Для яких груп: "збірна група В2(3)-н1", "потік Юс-21-1, Юс-21-2".
  title: string; // Назва предмета.
  type: string; // Тип, можна взяти з clasroomTypes, варіанти: "ІЗд", "Под", "Зал", "Екз", "Сем": "Л", "Пр", "".
  replacement: string; // варіанти: "Увага! Заняття перенесено у іншу аудиторію ауд.422 !", "Увага! Заміна! Золотарчук Н.І. замість: Терешкун Анна Василівна", "Увага! Заняття перенесено у іншу аудиторію ауд.чит.зал ! Увага! Заміна! Ходак С.М. замість: Яворська Надія Олександрівна" "Костишин О.Г. провів замість: Вірстюк Ольга Дмитрів", "Увага! Заняття відмінено!", "".
  reservation: string; // варіанти: "Так", "".
  online: string; //  Вказує чи це онлайн пара маючи такі варіанти: "Так", "".
  comment4link: string; // Зазвичай це додаткова інформація АкА коментар з доп інформацією як: Початок о 12:30, тестова форма, url + список студентів, ехнічних проблем звертатися в технічну підтримку в Telegram за.
  link: string; // хз що за хуйня, нічого немає.
}
